Revit 2026 API

# AdaptivePointType Enumeration

---

An enumerated type containing possible types for Adaptive Points.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum AdaptivePointType
```
```vb
Public Enumeration AdaptivePointType
```
```cpp
public enum class AdaptivePointType
```
```fsharp
type AdaptivePointType
```

| Member name | Value | Description |
| --- | --- | --- |
| PlacementPoint | 1 | Placement Point. |
| ReferencePoint | 0 | Reference Point. |
| ShapeHandlePoint | 2 | Shape Handle Point. |

#### Reference

Autodesk.Revit.DB Namespace